terraform for LEAP:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.user_buckets["persistent"] will be created
  + resource "google_storage_bucket" "user_buckets" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "leap-persistent"
      + project                     = "leap-pangeo"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket.user_buckets["persistent-staging"] will be created
  + resource "google_storage_bucket" "user_buckets" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "leap-persistent-staging"
      + project                     = "leap-pangeo"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket_iam_member.member["prod.persistent"] will be created
  + resource "google_storage_bucket_iam_member" "member" {
      + bucket = "leap-persistent"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:leap-prod@leap-pangeo.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_member.member["staging.persistent-staging"] will be created
  + resource "google_storage_bucket_iam_member" "member" {
      + bucket = "leap-persistent-staging"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:leap-staging@leap-pangeo.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ buckets = {
      + persistent         = "leap-persistent"
      + persistent-staging = "leap-persistent-staging"
        # (2 unchanged elements hidden)
    }

```